# [Gruppierungen] Apply und Lambda

In [1]:
import pandas as pd
umsatz = pd.read_csv("datengrundlage.xls")

### Gruppierung

In [2]:
umsatz.groupby(by="Land")[["Umsatz"]].mean()

                             Umsatz
Land
China                   5424.118085
Deutschland             7638.501449
Mexiko                  6191.175000
Südkorea                6094.123753
USA                     6947.958604
Vereinigtes Königreich  6540.703279

### Funktion erstellen

In [3]:
def steuer(x):
    return x * 1.19

In [5]:
steuer(20)

23.799999999999997

## apply

In [6]:
umsatz.groupby("Land")[["Umsatz"]].apply(steuer)

                                 Umsatz
Land
China                  3     10218.7680
                       11     8160.3060
                       18     4725.4305
                       30     5753.4120
                       34     8535.5130
...                                 ...
Vereinigtes Königreich 1324   6712.6710
                       1341   5559.3825
                       1347  10154.3295
                       1352   9070.6560
                       1370   9389.6355

[1380 rows x 1 columns]

## Lambda

In [7]:
steuer2 = lambda x: x*1.19

In [8]:
umsatz.groupby("Land")[["Umsatz"]].apply(steuer2)

                                 Umsatz
Land
China                  3     10218.7680
                       11     8160.3060
                       18     4725.4305
                       30     5753.4120
                       34     8535.5130
...                                 ...
Vereinigtes Königreich 1324   6712.6710
                       1341   5559.3825
                       1347  10154.3295
                       1352   9070.6560
                       1370   9389.6355

[1380 rows x 1 columns]